# 리스트(list, 목록)
# 홀수
a = [1,2,3,4,5]
b=[1,2,3]
c=['Life','is','too','short']
d=[1,2,'Life','is']
e=[1,2,['Life', 'is']]

# 인덱싱과 슬라이싱
b=[1,2,3]
print(b[0]) # 1
print(b[0]+b[2]) # 4
print(b[-1]) # 3

e=[1,2,3, ['a','b','c']]
print(e[0]) # 1
print(e[3]) # ['a','b','c']

print(e[-1][0]) # a
print(e[3][1]) # b
print(e[-1][2]) # c

e=[1,2,3,['a','b',['Life','is']]]
print(e[3][2][0]) # Life
print(e[-1][-1][-2]) # Life

## 슬라이싱
a=[1,2,3,4,5]
print(a[0:2]) #[1, 2]
print(a[:2]) #[1, 2]
print(a[2:]) #[3, 4, 5]
print(a[:]) #[1, 2, 3, 4, 5]

e=[1,2,3,['a','b','c'], 4, 5]
print(e[2:5]) # [3, ['a','b','c'], 4] 

## 리스트 연산
a=[1,2,3]
b=[4,5,6]
print(a+b) # [1,2,3,4,5,6]
print(a*3) #[1, 2, 3, 1, 2, 3, 1, 2, 3]
print(len(a)) # 3

a=[1,2,'3']
print(a[2]+'hi') # 문자와 숫자는 더할 수 없음 3을 문자열로 바꿔야함

a=[1,2,3]
print(str(a[2])+'hi') # 3hi 

### 리스트의 수정과 삭제
a = [1,2,3] 
a[2] = 4
print(a) # [1,2,4]

del a[1]
print(a) # [1, 4]





