# 내장함수
#append(): 요소추가
a=[1,2,3]
a.append(4)
print(a) #[1,2,3,4]

a.append([5,6])
print(a) # [1, 2, 3, 4, [5, 6]]
print("-------------------------------")
# sort(): 정렬 - 오름차순, 내림차순
a=[1,5,6,3,2,4]
a.sort()
print(a) # [1, 2, 3, 4, 5, 6]
print("-------------------------------")
a=['b','c','a','d']
a.sort()
print(a) #['a', 'b', 'c', 'd']
print("-------------------------------")
# reverse(): 역순
a=[1,4,3,2]
a.reverse()
print(a) # [2,3,4,1]

a.sort()
print(a) # [1,2,3,4]
a.reverse()
print(a) # [4,3,2,1]
print("-------------------------------")

# insert(인덱스, 아이템): 요소삽입
a=[1,2,3]
a.insert(0,4)
print(a) # [4,1,2,3]
a.insert(3,5)
print(a) # [4, 1, 2, 5, 3]
print("-------------------------------")

# remove() :삭제
a =[1,2,3,1,2,3]
a.remove(3)
print(a) #[1, 2, 1, 2, 3]
print("-------------------------------")

# pop():마지막 요소 꺼내기
a=[1,2,3]
print(a.pop()) # 3
print(a) # [1,2]
# pop([인덱스]): 해당 인덱스 요소 꺼내기
a= [1,2,3]
print(a.pop(1)) # 2
print(a) # [1,3]

 